---
kind: other
id: Properties.T:Autodesk.Revit.DB.OffsetSurface
source: html/222a305a-4304-978c-7d10-764446bc4ef6.htm
---
# OffsetSurface Properties

Specifies whether the .NET object represents a valid Revit entity.